spp901780/ElecPartsM_Embedded/.pack/Keil/STM32F0xx_DFP.2.1.0/CMSIS/Driver/bxCAN_STM32F0xx.c
static CAN_TypeDef * const ptr_CAN = (CAN_TypeDef *)CAN;

// Local variables and structures
static uint8_t                     can_driver_powered;
static uint8_t                     can_driver_initialized;
static uint8_t                     can_obj_cfg [CAN_TOT_OBJ_NUM];
static ARM_CAN_SignalUnitEvent_t   CAN_SignalUnitEvent;
static ARM_CAN_SignalObjectEvent_t CAN_SignalObjectEvent;


// Helper Functions

/**
  \fn          int32_t CAN_AddFilter (uint32_t obj_idx, CAN_FILTER_TYPE filter_type, uint32_t id, uint32_t mask)
  \brief       Add receive filter for specified id or id with mask.
  \param[in]   obj_idx      Receive object index assignment
  \param[in]   filter_type  Type of filter to add
                 - CAN_FILTER_TYPE_EXACT_ID:    exact id filter (id only)
                 - CAN_FILTER_TYPE_MASKABLE_ID: maskable filter (id and mask)
  \param[in]   id           Identifier
  \param[in]   mask         Identifier Mask
  \return      execution status
*/
static int32_t CAN_AddFilter (uint32_t obj_idx, CAN_FILTER_TYPE filter_type, uint32_t id, uint32_t mask) {
  uint32_t fa1r, frx, fry, msk;
  uint8_t  bank;
  int32_t  status;

  if (obj_idx >= CAN_RX_OBJ_NUM) { return ARM_DRIVER_ERROR_PARAMETER; }


  status = ARM_DRIVER_OK;
  ptr_CAN->FMR |= CAN_FMR_FINIT;                                        // Enter filter initialization mode

  bank = 0U;
  fa1r = ptr_CAN->FA1R;
  msk  = (uint32_t)1U << bank;

  if ((id & ARM_CAN_ID_IDE_Msk) != 0U) {                                // Extended Identifier
    frx = (id << 3) | CAN_FRx_32BIT_IDE;                                // id + IDE
    switch (filter_type) {
      case CAN_FILTER_TYPE_EXACT_ID:
        fry = (id << 3) | CAN_FRx_32BIT_IDE | CAN_FRx_32BIT_RTR;        // id + IDE + RTR
        while (bank <= CAN_FILTER_BANK_NUM) {                           // Find empty place for id
          if (bank == CAN_FILTER_BANK_NUM) {                            // If no free found exit
            status = ARM_DRIVER_ERROR;
            break;
          }
          if ((fa1r & msk) == 0U) {                                     // If filter is not active
            ptr_CAN->FM1R |=  msk;                                      // Select identifier list mode
            ptr_CAN->FS1R |=  msk;                                      // Select single 32-bit scale configuration
            if ((obj_idx & 1U) != 0U) {
              ptr_CAN->FFA1R |=  msk;                                   // Assign to FIFO1
            } else {
              ptr_CAN->FFA1R &= ~msk;                                   // Assign to FIFO0
            }
            ptr_CAN->sFilterRegister[bank].FR1 = frx;                   // id + IDE
            ptr_CAN->sFilterRegister[bank].FR2 = fry;                   // id + IDE + RTR
            break;
          }
          msk <<= 1U;
          bank++;
        }
        break;
      case CAN_FILTER_TYPE_MASKABLE_ID:
        fry = (mask << 3) | CAN_FRx_32BIT_IDE;                          // mask + IDE
        while (bank <= CAN_FILTER_BANK_NUM) {                           // Find empty place for id
          if (bank == CAN_FILTER_BANK_NUM) {                            // If no free found exit
            status = ARM_DRIVER_ERROR;
            break;
          }
          if ((fa1r & msk) == 0U) {                                     // If filter is not active
            ptr_CAN->FM1R &= ~msk;                                      // Select identifier mask mode
            ptr_CAN->FS1R |=  msk;                                      // Select single 32-bit scale configuration
            if ((obj_idx & 1U) != 0U) {
              ptr_CAN->FFA1R |=  msk;                                   // Assign to FIFO1
            } else {
              ptr_CAN->FFA1R &= ~msk;                                   // Assign to FIFO0
            }
            ptr_CAN->sFilterRegister[bank].FR1 = frx;                   // id + IDE
            ptr_CAN->sFilterRegister[bank].FR2 = fry;                   // mask + IDE
            break;
          }
          msk <<= 1U;
          bank++;
        }
        break;
      default:
        status = ARM_DRIVER_ERROR_PARAMETER;
        break;
    }
  } else {                                                              // Standard Identifier
    switch (filter_type) {
      case CAN_FILTER_TYPE_EXACT_ID:
        frx = ((id & 0xFFFFU) <<  5) |                                  // Low 16 bits = id
              ((id & 0xFFFFU) << 21) | CAN_FRx_16BIT_H_RTR;             // High 16 bits = id + RTR
        while (bank <= CAN_FILTER_BANK_NUM) {                           // Find empty place for id
          if (bank == CAN_FILTER_BANK_NUM) {                            // If no free found exit
            status = ARM_DRIVER_ERROR;
            break;
          }
          if ((fa1r & msk) == 0U) {                                     // If filter is not active
            ptr_CAN->FM1R |=  msk;                                      // Select identifier list mode
            ptr_CAN->FS1R &= ~msk;                                      // Select dual 16-bit scale configuration
            if ((obj_idx & 1U) != 0U) {
              ptr_CAN->FFA1R |=  msk;                                   // Assign to FIFO1
            } else {
              ptr_CAN->FFA1R &= ~msk;                                   // Assign to FIFO0
            }
            ptr_CAN->sFilterRegister[bank].FR1 = frx;
            ptr_CAN->sFilterRegister[bank].FR2 = 0xFFFFFFFFU;           // Disable unused slots
            break;
          } else if  (((ptr_CAN->FM1R & msk) != 0U) &&                  // If identifier list mode
                      ((ptr_CAN->FS1R & msk) == 0U) &&                  // If dual 16-bit scale configuration
                     (((ptr_CAN->FFA1R>>bank)&1U) == obj_idx)) {        // If bank has same FIFO assignment as requested
            if         (ptr_CAN->sFilterRegister[bank].FR1==0xFFFFFFFFU){// If n and n+1 entry are not used
              ptr_CAN->FA1R &= ~msk;                                    // Put filter in inactive mode
              ptr_CAN->sFilterRegister[bank].FR1 = frx;                 // id and id + RTR
              break;
            } else if  (ptr_CAN->sFilterRegister[bank].FR2==0xFFFFFFFFU){// If n+2 and n+3 entry are not used
              ptr_CAN->FA1R &= ~msk;                                    // Put filter in inactive mode
              ptr_CAN->sFilterRegister[bank].FR2 = frx;                 // id and id + RTR
              break;
            }
          }
          msk <<= 1U;
          bank++;
        }
        break;
      case CAN_FILTER_TYPE_MASKABLE_ID:
        frx = ((id   & 0xFFFFU) <<  5) |                                // Low 16 bits = id
              ((mask & 0xFFFFU) << 21) ;                                // High 16 bits = mask
        if ((mask & ARM_CAN_ID_IDE_Msk) != 0U) {                        // If IDE masking enabled
          frx |= CAN_FRx_16BIT_H_RTR;                                   // High 16 bits = mask + IDE
        }
        while (bank <= CAN_FILTER_BANK_NUM) {                           // Find empty place for id
          if (bank == CAN_FILTER_BANK_NUM) {                            // If no free found exit
            status = ARM_DRIVER_ERROR;
            break;
          }
          if ((fa1r & msk) == 0U) {                                     // If filter is not active
            ptr_CAN->FM1R &= ~msk;                                      // Select identifier mask mode
            ptr_CAN->FS1R &= ~msk;                                      // Select dual 16-bit scale configuration
            if ((obj_idx & 1U) != 0U) {
              ptr_CAN->FFA1R |=  msk;                                   // Assign to FIFO1
            } else {
              ptr_CAN->FFA1R &= ~msk;                                   // Assign to FIFO0
            }
            ptr_CAN->sFilterRegister[bank].FR1 = frx;
            ptr_CAN->sFilterRegister[bank].FR2 = 0xFFFFFFFFU;           // Disable unused slots
            break;
          } else if ((((ptr_CAN->FM1R | ptr_CAN->FS1R)&msk)==0U) &&     // If identifier mask mode and dual 16-bit scale configuration
                     (((ptr_CAN->FFA1R >> bank)&1U)==obj_idx)) {        // If bank has same FIFO assignment as requested
            if         (ptr_CAN->sFilterRegister[bank].FR1==0xFFFFFFFFU){// If n and n+1 entry are not used
              ptr_CAN->FA1R &= ~msk;                                    // Put filter in inactive mode
              ptr_CAN->sFilterRegister[bank].FR1 = frx;                 // id and mask
              break;
            } else if  (ptr_CAN->sFilterRegister[bank].FR2==0xFFFFFFFFU){// If n+2 and n+3 entry are not used
              ptr_CAN->FA1R &= ~msk;                                    // Put filter in inactive mode
              ptr_CAN->sFilterRegister[bank].FR2 = frx;                 // id and mask
              break;
            }
          }
          msk <<= 1U;
          bank++;
        }
        break;
      default:
        status = ARM_DRIVER_ERROR_PARAMETER;
        break;
    }
  }

  if (status == ARM_DRIVER_OK) {
    ptr_CAN->FA1R |= msk;                                               // Put filter in active mode
  }
  ptr_CAN->FMR  &= ~CAN_FMR_FINIT;                                      // Exit filter initialization mode

