spp901780/ElecPartsM_Embedded/.pack/Keil/STM32F0xx_DFP.2.1.0/CMSIS/Driver/bxCAN_STM32F0xx.c
  if ((status == ARM_DRIVER_OK)                            && 
     ((ptr_CAN->sFilterRegister[bank].FR1 != 0xFFFFFFFFU)  || 
      (ptr_CAN->sFilterRegister[bank].FR2 != 0xFFFFFFFFU))) {
    ptr_CAN->FA1R |= msk;                                               // Put filter in active mode
  }
  ptr_CAN->FMR  &= ~CAN_FMR_FINIT;                                      // Exit filter initialization mode

  return status;
}

// CAN Driver Functions

/**
  \fn          ARM_DRIVER_VERSION CAN_GetVersion (void)
  \brief       Get driver version.
  \return      ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION CAN_GetVersion (void) { return can_driver_version; }

/**
  \fn          ARM_CAN_CAPABILITIES CAN_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      ARM_CAN_CAPABILITIES
*/
static ARM_CAN_CAPABILITIES CAN_GetCapabilities (void) { return can_driver_capabilities; }

/**
  \fn          int32_t CAN_Initialize (ARM_CAN_SignalUnitEvent_t   cb_unit_event,
                                       ARM_CAN_SignalObjectEvent_t cb_object_event)
  \brief       Initialize CAN interface and register signal (callback) functions.
  \param[in]   cb_unit_event   Pointer to ARM_CAN_SignalUnitEvent callback function
  \param[in]   cb_object_event Pointer to ARM_CAN_SignalObjectEvent callback function
  \return      execution status
*/
static int32_t CAN_Initialize (ARM_CAN_SignalUnitEvent_t   cb_unit_event,
                               ARM_CAN_SignalObjectEvent_t cb_object_event) {

  if (can_driver_initialized != 0U) { return ARM_DRIVER_OK; }

  CAN_SignalUnitEvent   = cb_unit_event;
  CAN_SignalObjectEvent = cb_object_event;

  hcan.Instance = CAN;

  can_driver_initialized = 1U;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t CAN_Uninitialize (void)
  \brief       De-initialize CAN interface.
  \return      execution status
*/
static int32_t CAN_Uninitialize (void) {

  hcan.Instance          = NULL;

  can_driver_initialized = 0U;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t CAN_PowerControl (ARM_POWER_STATE state)
  \brief       Control CAN interface power.
  \param[in]   state  Power state
                 - ARM_POWER_OFF :  power off: no operation possible
                 - ARM_POWER_LOW :  low power mode: retain state, detect and signal wake-up events
                 - ARM_POWER_FULL : power on: full operation at maximum performance
  \return      execution status
*/
static int32_t CAN_PowerControl (ARM_POWER_STATE state) {
  uint32_t msk;
  uint32_t tout_cnt;
  uint8_t  bank;

  switch (state) {
    case ARM_POWER_OFF:
      can_driver_powered = 0U;
      NVIC_DisableIRQ(CEC_CAN_IRQn);
      if (hcan.Instance != NULL) {
        HAL_CAN_DeInit (&hcan);
      }
      memset((void *)&can_obj_cfg[0], 0, CAN_TOT_OBJ_NUM);
      break;

    case ARM_POWER_FULL:
      if (can_driver_initialized == 0U) { return ARM_DRIVER_ERROR; }
      if (can_driver_powered     != 0U) { return ARM_DRIVER_OK;    }
      if (hcan.Instance != NULL) {
        HAL_CAN_MspInit(&hcan);
      }

      ptr_CAN->MCR = CAN_MCR_RESET;             // Reset CAN controller
      tout_cnt = SystemCoreClock / 64U;         // Wait, with timeout, for reset to end
      while ((ptr_CAN->MCR & CAN_MCR_RESET) != 0U) {
        if (tout_cnt-- == 0U) { return ARM_DRIVER_ERROR; }
      }

      // Initialize filter banks
      bank = 0U;
      msk  = ((uint32_t)1U << CAN_FILTER_BANK_NUM) - (uint32_t)1U;
      ptr_CAN->FMR  |=  CAN_FMR_FINIT;          // Enter filter initialization mode
      ptr_CAN->FA1R &= ~msk;                    // Put all filters in inactive mode
      ptr_CAN->FM1R &= ~msk;                    // Initialize all filters mode
      ptr_CAN->FS1R &= ~msk;                    // Initialize all filters scale configuration
      while (bank <= CAN_FILTER_BANK_NUM) {     // Go through all banks
        if (bank == CAN_FILTER_BANK_NUM) { break; }
        ptr_CAN->sFilterRegister[bank].FR1 = 0U;
        ptr_CAN->sFilterRegister[bank].FR2 = 0U;
        bank++;
      }

      memset((void *)&can_obj_cfg[0], 0, CAN_TOT_OBJ_NUM);

      ptr_CAN->IER =   CAN_IER_TMEIE  |         // Enable Interrupts
                       CAN_IER_FMPIE0 |
                       CAN_IER_FOVIE0 |
                       CAN_IER_FMPIE1 |
                       CAN_IER_FOVIE1 |
                       CAN_IER_EWGIE  |
                       CAN_IER_EPVIE  |
                       CAN_IER_BOFIE  |
                       CAN_IER_ERRIE  ;

      can_driver_powered = 1U;

      if ((CAN_SignalUnitEvent != NULL) || (CAN_SignalObjectEvent != NULL)) {
        NVIC_ClearPendingIRQ (CEC_CAN_IRQn);
        NVIC_EnableIRQ       (CEC_CAN_IRQn);
      }
      break;

    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t CAN_GetClock (void)
  \brief       Retrieve CAN base clock frequency.
  \return      base clock frequency
*/
static uint32_t CAN_GetClock (void) {
  return HAL_RCC_GetPCLK1Freq();
}

/**
  \fn          int32_t CAN_SetBitrate (ARM_CAN_BITRATE_SELECT select, uint32_t bitrate, uint32_t bit_segments)
  \brief       Set bitrate for CAN interface.
  \param[in]   select       Bitrate selection
                 - ARM_CAN_BITRATE_NOMINAL : nominal (flexible data-rate arbitration) bitrate
                 - ARM_CAN_BITRATE_FD_DATA : flexible data-rate data bitrate
  \param[in]   bitrate      Bitrate
  \param[in]   bit_segments Bit segments settings
  \return      execution status
*/
static int32_t CAN_SetBitrate (ARM_CAN_BITRATE_SELECT select, uint32_t bitrate, uint32_t bit_segments) {
  uint32_t     mcr, sjw, prop_seg, phase_seg1, phase_seg2, pclk, brp, tq_num, tmp, tout_cnt;

  if (select != ARM_CAN_BITRATE_NOMINAL) { return ARM_CAN_INVALID_BITRATE_SELECT; }
  if (can_driver_powered == 0U)          { return ARM_DRIVER_ERROR;               }

  prop_seg   = (bit_segments & ARM_CAN_BIT_PROP_SEG_Msk  ) >> ARM_CAN_BIT_PROP_SEG_Pos;
  phase_seg1 = (bit_segments & ARM_CAN_BIT_PHASE_SEG1_Msk) >> ARM_CAN_BIT_PHASE_SEG1_Pos;
  phase_seg2 = (bit_segments & ARM_CAN_BIT_PHASE_SEG2_Msk) >> ARM_CAN_BIT_PHASE_SEG2_Pos;
  sjw        = (bit_segments & ARM_CAN_BIT_SJW_Msk       ) >> ARM_CAN_BIT_SJW_Pos;

  if (((prop_seg + phase_seg1) < 1U) || ((prop_seg + phase_seg1) > 16U)) { return ARM_CAN_INVALID_BIT_PROP_SEG;   }
  if (( phase_seg2             < 1U) || ( phase_seg2             >  8U)) { return ARM_CAN_INVALID_BIT_PHASE_SEG2; }
  if (( sjw                    < 1U) || ( sjw                    >  4U)) { return ARM_CAN_INVALID_BIT_SJW;        }

  tq_num = 1U + prop_seg + phase_seg1 + phase_seg2;
  pclk   = CAN_GetClock ();           if (pclk == 0U)  { return ARM_DRIVER_ERROR;        }
  brp    = pclk / (tq_num * bitrate); if (brp > 1024U) { return ARM_CAN_INVALID_BITRATE; }
  tmp    = (brp * tq_num * bitrate);
  if        (pclk > tmp) {
    if   ((((pclk - tmp) * 1024U) / pclk) > CAN_CLOCK_TOLERANCE) { return ARM_CAN_INVALID_BITRATE; }
  } else if (pclk < tmp) {
    if   ((((tmp - pclk) * 1024U) / pclk) > CAN_CLOCK_TOLERANCE) { return ARM_CAN_INVALID_BITRATE; }
  }

  mcr = ptr_CAN->MCR;
  ptr_CAN->MCR = CAN_MCR_INRQ;                  // Activate initialization mode
  tout_cnt = SystemCoreClock / 64U;             // Wait, with timeout, for initialization to activate
  while ((ptr_CAN->MSR & CAN_MSR_INAK) == 0U) {
    if (tout_cnt-- == 0U) { return ARM_DRIVER_ERROR; }
  }

  ptr_CAN->BTR = (ptr_CAN->BTR & (CAN_BTR_LBKM | CAN_BTR_SILM)) | ((brp - 1U) & CAN_BTR_BRP) | ((sjw - 1U) << 24) | ((phase_seg2 - 1U) << 20) | ((prop_seg + phase_seg1 - 1U) << 16);
  ptr_CAN->MCR =  mcr;                          // Return to previous mode

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t CAN_SetMode (ARM_CAN_MODE mode)
  \brief       Set operating mode for CAN interface.
  \param[in]   mode   Operating mode
                 - ARM_CAN_MODE_INITIALIZATION :    initialization mode
                 - ARM_CAN_MODE_NORMAL :            normal operation mode
                 - ARM_CAN_MODE_RESTRICTED :        restricted operation mode
                 - ARM_CAN_MODE_MONITOR :           bus monitoring mode
                 - ARM_CAN_MODE_LOOPBACK_INTERNAL : loopback internal mode
                 - ARM_CAN_MODE_LOOPBACK_EXTERNAL : loopback external mode
  \return      execution status
*/
static int32_t CAN_SetMode (ARM_CAN_MODE mode) {
  uint32_t     event, tout_cnt;

  event = 0U;
  switch (mode) {
    case ARM_CAN_MODE_INITIALIZATION:
      ptr_CAN->FMR |=  CAN_FMR_FINIT;           // Filter initialization mode
      ptr_CAN->MCR  =  CAN_MCR_INRQ;            // Enter initialization mode
      tout_cnt = SystemCoreClock / 64U;         // Wait, with timeout, to enter initialization mode
      while ((ptr_CAN->MSR & CAN_MSR_INAK) == 0U) {
        if (tout_cnt-- == 0U) { return ARM_DRIVER_ERROR; }
      }
      event = ARM_CAN_EVENT_UNIT_BUS_OFF;
      break;

    case ARM_CAN_MODE_NORMAL:
      ptr_CAN->MCR |=  CAN_MCR_INRQ;            // Enter initialization mode
      tout_cnt = SystemCoreClock / 64U;         // Wait, with timeout, to enter initialization mode
      while ((ptr_CAN->MSR & CAN_MSR_INAK) == 0U) {
        if (tout_cnt-- == 0U) { return ARM_DRIVER_ERROR; }
      }
      ptr_CAN->BTR &=~(CAN_BTR_LBKM | CAN_BTR_SILM);
      ptr_CAN->MCR  =  CAN_MCR_ABOM |           // Activate automatic bus-off
                       CAN_MCR_AWUM ;           // Enable automatic wakeup mode
      tout_cnt = SystemCoreClock / 64U;         // Wait, with timeout, to exit initialization mode
      while ((ptr_CAN->MSR & CAN_MSR_INAK) != 0U) {
        if (tout_cnt-- == 0U) { return ARM_DRIVER_ERROR; }
      }
      ptr_CAN->FMR &= ~CAN_FMR_FINIT;           // Filter active mode
      event = ARM_CAN_EVENT_UNIT_ACTIVE;
      break;

    case ARM_CAN_MODE_RESTRICTED:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

